tap "buo/cask-upgrade"
tap "charmbracelet/tap"
tap "daipeihust/tap"
tap "domt4/autoupdate"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "khanhas/tap"
tap "samuelmeuli/tap"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Library for manipulating PNG images
brew "libpng"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Shell extension to jump to frequently used directories
brew "autojump"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Compiler infrastructure and toolchain library for WebAssembly
brew "binaryen"
# Python code formatter
brew "black"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Сoncurrent, cache-efficient, and Dockerfile-agnostic builder toolkit
brew "buildkit"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# GNU CLISP, a Common Lisp implementation
brew "clisp"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# High performance code minimap generator
brew "code-minimap"
# Tunnel SSH through HTTP proxies
brew "corkscrew"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Tool for exploring each layer in a docker image
brew "dive"
# Bash completion for Django
brew "django-completion"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: true
# Pack, ship and run any application as a lightweight container
brew "docker"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Replay stored shell commands for live presentations
brew "doitlive"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# General purpose Language Server
brew "efm-langserver"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# NaCl networking and cryptography library
brew "libsodium"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Compression/decompression library aiming for high speed
brew "snappy"
# High-performance, asynchronous messaging library
brew "zeromq"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Client app of fast reverse proxy to expose a local server to the internet
brew "frpc", restart_service: true
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Git extension for versioning large files
brew "git-lfs"
# Official GitLab CI runner
brew "gitlab-runner"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Go version management
brew "goenv", args: ["HEAD"]
# Library to render SVG files using Cairo
brew "librsvg"
# Reliable, high performance TCP/HTTP load balancer
brew "haproxy"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Database of common MIME types
brew "shared-mime-info"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Terminal Client for Redis with AutoCompletion and Syntax Highlighting
brew "iredis"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Bash completion for Launchctl
brew "launchctl-completion"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Implementation of the file(1) command
brew "libmagic"
# Postgres C API library
brew "libpq"
# Library for storing/retrieving passwords and other secrets
brew "libsecret"
# General purpose TCP-IP emulator
brew "libslirp"
# Next-gen compiler infrastructure
brew "llvm"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# Securely transfers data between computers
brew "magic-wormhole"
# MariaDB database connector for C applications
brew "mariadb-connector-c"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Run a Kubernetes cluster locally
brew "minikube"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Remote terminal application
brew "mosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql", restart_service: true
# Open source relational database management system
brew "mysql-client"
# Fast, highly customisable system info script
brew "neofetch"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Platform built on V8 to build network applications
brew "node"
# Bash completion for open
brew "open-completion"
# Simplified-traditional Chinese conversion tool
brew "opencc"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Modern Python package and dependency manager supporting the latest PEP standards
brew "pdm"
# Bash completion for Pip
brew "pip-completion"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Draw UML diagrams
brew "plantuml"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Python package management tool
brew "poetry"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Modern replacement for ps written by Rust
brew "procs"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Alternative to pyenv for managing virtualenvs
brew "pyenv-virtualenvwrapper"
# Visualize data generated by Cachegrind and Calltree
brew "qcachegrind"
# Emulator for x86 and PowerPC
brew "qemu"
# Cross-platform application and UI framework
brew "qt"
# Ruby version manager
brew "rbenv"
# Adds basic gemset support to rbenv
brew "rbenv-gemset"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Lisp installer and launcher for major environments
brew "roswell"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Bash completion for rustc
brew "rustc-completion"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# Tools for market analysis
brew "ta-lib"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Maintained ctags implementation
brew "universal-ctags"
# Image processing library
brew "vips"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Show the current WiFi network password
brew "wifi-password"
# JavaScript package manager
brew "yarn"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# GPU-accelerated terminal emulator
cask "alacritty"
# Android SDK component
cask "android-platform-tools"
# Audio utility
cask "background-music"
# Lock/unlock Apple computers using the proximity of a bluetooth low energy device
cask "bleunlock"
# GUI app for Homebrew
cask "cakebrew"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# Project management software
cask "feishu"
# Grammarly for desktop
cask "grammarly-desktop"
# Keyboard customizer
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Self-contained Python driver for communicating with MySQL servers
cask "mysql-connector-python"
# HTTP client that helps testing and describing APIs
cask "paw"
# PDF reader, editor and annotator
cask "pdf-expert"
# Open source virtual/remote desktop application
cask "rustdesk"
# Screenshot measurement and annotation tool
cask "shottr"
# Taps into Soundflower channels and route them to an audio device
cask "soundflowerbed"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Native GUI tool for relational databases
cask "tableplus"
# Mesh VPN based on Wireguard
cask "tailscale"
# Voice communication client
cask "teamspeak-client"
# Utility to change the default backup interval of Time Machine
cask "timemachineeditor"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Development environment
cask "vagrant"
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark"
# HTML to PDF renderer
cask "wkhtmltopdf"
# Collect, organize, cite, and share research sources
cask "zotero"
mas "Bob", id: 1630034110
mas "iMazing Converter", id: 1292198261
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft To Do", id: 1274495053
mas "Microsoft Word", id: 462054704
mas "moomoo", id: 1482713641
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "QQ", id: 451108668
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "TickTick", id: 966085870
mas "WeChat", id: 836500024
mas "Xcode", id: 497799835
