tap "buo/cask-upgrade"
tap "cantino/mcfly", "https://github.com/cantino/mcfly"
tap "charmbracelet/tap"
tap "d12frosted/emacs-plus"
tap "domt4/autoupdate"
tap "github/gh"
tap "gphotosuploader/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "khanhas/tap"
tap "minio/stable"
tap "railwaycat/emacsmacport"
tap "samuelmeuli/tap"
tap "zaquestion/tap"
brew "openssl@1.1"
brew "autojump"
brew "awscli@1"
brew "bat"
brew "binaryen"
brew "black"
brew "brew-gem"
brew "buildkit"
brew "caddy"
brew "gettext"
brew "pkg-config"
brew "clisp"
brew "cmake"
brew "code-minimap"
brew "composer"
brew "coreutils"
brew "corkscrew"
brew "ctags"
brew "deno"
brew "dive"
brew "django-completion"
brew "dnsmasq", restart_service: true
brew "docker", link: false
brew "docker-compose", link: false
brew "docker-compose-completion"
brew "doitlive"
brew "dos2unix"
brew "efm-langserver"
brew "exa"
brew "exercism"
brew "fd"
brew "guile"
brew "gnutls"
brew "libsodium"
brew "sdl2"
brew "snappy"
brew "zeromq"
brew "ffmpeg"
brew "fontforge"
brew "freetds"
brew "frpc", restart_service: true
brew "fzf"
brew "gawk"
brew "gdb"
brew "go"
brew "gh"
brew "gifsicle"
brew "git-extras"
brew "git-lfs"
brew "gitlab-runner"
brew "graphviz"
brew "haproxy"
brew "helm"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "node"
brew "insect"
brew "iproute2mac"
brew "jq"
brew "kubernetes-cli"
brew "launchctl-completion"
brew "libmagic"
brew "libsecret"
brew "libxml2"
brew "lsd"
brew "luajit", args: ["HEAD"]
brew "magic-wormhole"
brew "mariadb-connector-c"
brew "mas"
brew "maven"
brew "mosh"
brew "mtr"
brew "mycli"
brew "mysql", restart_service: true
brew "mysql-client"
brew "tree-sitter"
brew "neovim"
brew "netcat"
brew "nginx"
brew "nodenv"
brew "numpy"
brew "open-completion"
brew "opencc"
brew "pandoc"
brew "pdm"
brew "php"
brew "pip-completion"
brew "pipx"
brew "plantuml"
brew "podman"
brew "poetry"
brew "pre-commit"
brew "procs"
brew "pstree"
brew "pyenv"
brew "pyenv-virtualenvwrapper"
brew "qcachegrind"
brew "qt"
brew "rbenv"
brew "rbenv-gemset"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep"
brew "roswell"
brew "ruby"
brew "rust"
brew "rust-analyzer"
brew "rustc-completion"
brew "shellcheck"
brew "spark"
brew "stern"
brew "stow"
brew "streamlink"
brew "telnet"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "watch"
brew "websocat"
brew "wget"
brew "wifi-password"
brew "yarn"
brew "yarn-completion"
brew "youtube-dl"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "cantino/mcfly/mcfly"
brew "minio/stable/mc"
brew "samuelmeuli/tap/tmignore"
brew "zaquestion/tap/lab"
cask "aerial"
cask "android-platform-tools"
cask "background-music"
cask "bleunlock"
cask "cakebrew"
cask "docker"
cask "mysql-connector-python"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "soundflower"
cask "soundflowerbed"
cask "squirrel"
cask "timemachineeditor"
cask "wireshark"
